#+TITLE: Org-glance: walk in the woods with pleasure
#+AUTHOR: Dmitry Akatov
#+EMAIL: akatovda@yandex.com

#+CATEGORY: org-glance
#+STARTUP: overview

[[https://travis-ci.com/rails-to-cosmos/org-glance][https://travis-ci.com/rails-to-cosmos/org-glance.svg?branch=master]]

This repository is nothing more than a brainstorming sandbox in a
field of graph processing and visualization.

#+begin_src emacs-lisp
(use-package org-glance
    :load-path "~/sync/stuff/org-glance"
    :bind (("C-x j" . org-glance-form-action)
           :map org-mode-map
           ("@" . org-glance:@))
    :config (setq org-glance-directory "~/sync/views")
    :ensure aes)
#+end_src

* Issues
** TODO completing read
** TODO proper table view
** TODO mentions in capture
** TODO material mode: proper tags removal (update local buffer variables)
** TODO class overview
** TODO clone + reschedule
** DONE bidirected relations
CLOSED: [2021-11-20 Sat 13:59]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2021-11-20 Sat 13:59]
CLOCK: [2021-11-20 Sat 11:08]--[2021-11-20 Sat 12:45] =>  1:37
- Clocked out on [2021-11-20 Sat 12:45]
- State "STARTED"    from "TODO"       [2021-11-20 Sat 11:08]
:END:
** DONE delete class feature
CLOSED: [2021-11-20 Sat 16:36]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-20 Sat 16:36]
:END:
** TODO Implement day-grained CAPACITY
show it with schedule (as an overlay)
** TODO able to capture any text without headlines (default headline will be generated then)
** TODO Repeat and clone diary-cyclic monthly entries
** DONE Save after clone
CLOSED: [2021-11-17 Wed 16:54]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-17 Wed 16:54]
:END:
** DONE Proper partition sort implementation
CLOSED: [2021-11-17 Wed 16:54]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-17 Wed 16:54]
:END:
** TODO Implement capacity concept
** DONE Clone feature (clone on repeat, clone-archive+reschedule)
CLOSED: [2021-11-13 Sat 14:17]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-13 Sat 14:17]
:END:
** DONE Split capture and reschedule?
CLOSED: [2021-10-23 Sat 13:24]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-23 Sat 13:24]
:END:
** TODO Overview kill-headline should do materialization. Add tests
** DONE Fix headline-at-point behavior
CLOSED: [2021-10-13 Wed 14:28]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-13 Wed 14:28]
:END:
** TODO Gamification
- [[https://en.wikipedia.org/wiki/Colossal_Cave_Adventure][Colossal Cave Adventure - Wikipedia]]
** Anchor Modeling
- =Article= [[org-glance-visit:Article-20210826-7dc7b39dcaf77d1f25d654967a3a1afd][Anchor Modeling: Peridata between Data and Metadata]]
- =Article= [[org-glance-visit:Article-20210826-9b1d041ca0c9581606151a2ae496115d][Modeling Conflicting, Unreliable, and Varying Information]]
- Implement anchormodeling logbook management (store appearance sets in logbook drawer).
- Reserve posit, ascertains, thing, and class.
- Implement transactions.
- Distinguish data, metadata and peridata (peripheral data, domain classifications).
- Think about how to implement metadata.
- [[https://github.com/Roenbaeck/bareclad][GitHub - Roenbaeck/bareclad: Based on transitional modeling, bareclad is a new type of database that provides features from relational, graph, columnar, and name-value pair databases.]]

Use posits in logbook drawer: [
  {(thing 1, role 1), ..., (thing n, role n)},
  appearing value,
  time of appearance
]

Cache roles: employee/employer, contact/task
** Visualization
*** [[https://observablehq.com/@mbostock/tree-of-life][Tree of Life / Mike Bostock / Observable]]
*** [[https://observablehq.com/@d3/gallery][Gallery / D3 / Observable]]
- [[http://bl.ocks.org/NPashaP/96447623ef4d342ee09b][DashBoard - bl.ocks.org]]
- [[http://bl.ocks.org/joews/9697914][Animated d3 word cloud - bl.ocks.org]]
- [[http://bl.ocks.org/erkal/9746513][Random Graph Generator - bl.ocks.org]]
- [[http://bl.ocks.org/chaitanyagurrapu/6007521][A Google calendar like display for temporal data using D3.Js - bl.ocks.org]]
- [[http://bl.ocks.org/Jverma/887877fc5c2c2d99be10][Bar chart from external JSON file - bl.ocks.org]]
*** [[https://dc-js.github.io/dc.js/][dc.js - Dimensional Charting Javascript Library]]
*** [[https://www.data-to-viz.com/graph/edge_bundling.html][Hierarchical edge bundling – from Data to Viz]]
*** [[https://bl.ocks.org/vasturiano/ded69192b8269a78d2d97e24211e64e0][Timelines Chart - bl.ocks.org]]
*** https://lliquid.github.io/homepage/files/ts13_edgebundle.pdf
** TODO Overview Mode
*** TODO overview of all views registered with view-scoped actions
:LOGBOOK:
- State "STARTED"    from "TODO"       [2021-09-12 Sun 14:06]
CLOCK: [2021-09-12 Sun 14:06]--[2021-09-12 Sun 16:28] =>  2:22
- Clocked out on [2021-09-12 Sun 16:28]
:END:
*** TODO commented headlines restrictions
*** TODO org-overview-mode: modify-sync headline feature
*** DONE org-overview-mode: add headline feature
CLOSED: [2021-08-26 Thu 10:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-08-26 Thu 10:40]
:END:
*** TODO org-glance:format issue for strings containing % symbol
** TODO Headline API
*** TODO headline API: add unit tests
** TODO Agenda and Notifications
** Completing Read [0/1]
*** TODO build titles from all direct relations
** Unsorted [5/18]
*** TODO Resolve title collision by traversing dependencies
*** TODO Handle capture cancelling
*** TODO Clone repetitive headlines
*** DONE [#A] make headline types implicit with headline grain
CLOSED: [2021-10-01 Fri 16:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-01 Fri 16:40]
:END:
*** DONE implement custom schedule (maybe for ledna)
CLOSED: [2021-10-01 Fri 16:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-01 Fri 16:40]
:END:
*** TODO high priority for current clocked-in dependencies in completing read
*** DONE remove headline feature
CLOSED: [2021-10-01 Fri 16:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-01 Fri 16:40]
:END:
*** TODO capture templates support
*** CANCELLED change metastore serialization format (elisp → json)
CLOSED: [2021-10-01 Fri 16:40]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2021-10-01 Fri 16:40]
:END:
*** TODO mutable states → publish-subscribe model
- implement write ahead log
- store initial state and diffs, then apply compaction
- subscribe on changes
*** DONE register headlines in metastore & overview on materialized sync
CLOSED: [2021-09-12 Sun 13:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-09-12 Sun 13:45]
:END:
*** TODO refactor capture with org-refile
*** TODO [#C] If summary is unregistered, prompt to register it before any user action
*** TODO Read views from directory to minimize config
:LOGBOOK:
- State "STARTED"    from "TODO"       [2021-09-03 Fri 09:46]
CLOCK: [2021-09-03 Fri 09:46]--[2021-09-03 Fri 18:15] =>  8:29
- Clocked out on [2021-09-03 Fri 19:15]
:END:
*** TODO [#C] lexical binding breaks formatting
*** TODO view-based materialized view buffer names: *materialized-event*
*** TODO views github-like dashboards

| #   | Jul | Aug | Sep | Oct | Nov | Dec |
|-----+-----+-----+-----+-----+-----+-----|
| Mon | ▬▬▬ | ### | ### | ### | ### | ### |
| Tue | ▬▬▬ | ### | ### | ### | ### | ### |
| Wed | ### | ### | ### | ### | ### | ### |
| Thu | ### | ### | ### | ### | ### | ### |
| Fri | ### | ### | ### | ### | ### | ### |
| Sat | ### | ### | ### | ### | ### | ### |
| Sun | ### | ### | ### | ### | ### | ### |

*** TODO read-only flag for materialized views
*** TODO full-text search
*** TODO parse encrypted blocks in any point of subtree
*** TODO make ARCHIVED/Commented entries inactive (it is populated by EXPORT, but not visible in OPEN/VISIT/MATERIALIZE)
** TODO New Actions
*** TODO Execute Babel Blocks and Retrieve Results
* Thoughts

- [[https://github.com/narendraj9/emlib][emlib: a humble Machine Learning library]]
- https://grishaev.me/clj-zippers-1/
- https://github.com/bbatsov/emacs-lisp-style-guide
- https://ctan.org/pkg/pgfgantt
- https://i.imgur.com/rjmfauQ.png
- https://www.reddit.com/r/emacs/comments/5yhk1m/gantt_charts_for_orgmode/
- http://fastcompression.blogspot.com/p/lz4.html
- https://en.wikipedia.org/wiki/Conflict-free_replicated_data_type
- https://towardsdatascience.com/how-to-build-a-complex-reporting-dashboard-using-dash-and-plotl-4f4257c18a7f#a5c5

* dist-packages

- https://github.com/skeeto/emacsql
- https://magit.vc/manual/transient/
- https://altair-viz.github.io/getting_started/overview.html
